import './InfoPage.css';

const InfoPage = () => {
  return (
    <div className="info-page">
      <div className="left-panel"></div> 
      <div className='text'>
        <p className='title'>Բեկուսի FP լեզու</p>
        <p>Նկարագրենք (M, C, X, T) քառյակը։</p>
        <p>Նախ սահմանենք A բազմությունը, որպես թվերի և իդենտիֆիկատրների բազմություն։ Գոյություն ունեն ատոմներ, որոնք ունեն որոշակի իմաստ, օրինակ՝ true (տրամաբանական "ճիշտ" արժեք), false (տրամաբանական "սխալ" արժեք), nil(դատարկ ցուցակ)։ </p>
        <p>M-ը անվանում ենք օբյեկտների բազմություն, որը սահմանվում է հետևյալ կերպ․</p>
        <p>1. Եթե m ∈ A, ապա m ∈ M</p>
        <p>2․ ⊥ ∈ M։</p>
        <p>3. Եթե m1, m2, ..., mk ∈ M (k ≥ 0), ապա (m1, m2, ..., mk) ∈ M, և եթե որևէ i-ի համար (1 ≤ i ≤ k), mi = ⊥, ապա (m1, m2, ..., mk) = ⊥։</p>
        <p>4․ Ուրիշ օբյեկտներ չկան։</p>
        <p>Եթե (m1, m2, ..., mk) ∈ M, k ≥ 0, ապա (m1, m2, ..., mk) կանվանենք ցուցակ, իսկ k-ն՝ նրա երկարություն։ Ցուցակը, որի երկարությունը հավասար է0-ի կանվանենք դատարկ ցուցակ, որը կնշանակենք nil ատոմով։</p>
        <p>Այժմ նկարագրենք C բազմությունը։</p>
        <p>C = M ∪ C1 ∪ C2, որտեղ C1-ըառաջին կարգի հաստատուններ են, իսկ C2-ը՝ երկրորդ կարգի։ Նկարագրենք դրանք։</p>
        <p>C1 = {`{si | i ≥ 1}`} ∪ {`{id, tl, apndl, apndr, null, atom, eq, '+', '-', /, *, and, or, not, ...}`}</p>
        <p>Նշենք, որ եթե f ∈ M1, ապա f ∈ {'[M->M]'}: Սահմանենք դրանք ցանկացած m ∈ M համար․</p>
        <p>Selector Functions (ընդհարման ֆունկցիաներ)</p>
        <p>si(m) = mi, եթե m = (m1, m2, ..., mk), 1 ≤ i ≤ k, k ≥ 1, հակառակ դեպքում՝ ⊥</p>
        <p>Identity (նույնություն)</p>
        <p>id(m) = m</p>
        <p>Tail (պոչ)</p>
        <p>tl(m) = nil, եթե m = (m1), (m2, m3, ..., mk), եթե m = (m1, m2, ..., mk), k {'>'} 1, մնացած դեպքերում՝ ⊥</p>
        <p>Append Left (ավելացնել օբյեկտ ձախից)</p>
        <p>apndl(m) = (m0, m1, ..., mk), եթե m = (m0, (m1, m2, ..., mk)), k ≥ 1, (m0), եթե m = (m0, nil), մնացած դեպքերում՝ ⊥</p>
        <p>Append Right (ավելացնել օբյեկտ աջից)</p>
        <p>appndr(m) = (m1, ..., mk, m0), եթե m = (m0, (m1, m2, ..., mk)), k ≥ 1, եթե m = (m0, nil), մնացած դեպքերում՝ ⊥</p>
        <p>Null (դատարկ)</p>
        <p>null(m) = true, եթե m = nil, fasle, եթե m ≠ ⊥ և m ≠ nil, մնացած դեպքերում՝ ⊥</p>
        <p>Atom (ատոմ)</p>
        <p>atom(m) = true, m ∈ A, false, եթե m ∉ A և m ≠ ⊥, մնացած դեպքերում՝ ⊥</p>
        <p>Equals (հավասար)</p>
        <p>eq(m) = true, եթե m = (m1, m2) և m1 = m2, false, եթե m = (m1, m2) և m1 ≠ m2, մնացած դեպքերում՝ ⊥</p>
        <p>+(m) = m1 + m2, եթե m = (m1, m2) և m1, m2-ը թվեր են, մնացած դեպքերում՝ ⊥</p>
        <p>֊(m) = m1 - m2, եթե m = (m1, m2) և m1, m2-ը թվեր են, մնացած դեպքերում՝ ⊥</p>
        <p>*(m) = m1 * m2, եթե m = (m1, m2) և m1, m2-ը թվեր են, մնացած դեպքերում՝ ⊥</p>
        <p></p>
        <p></p>
        <p></p>
        <p></p>
      </div>
      
    </div>
  );
};

export default InfoPage;