import './InfoPageHerbranGyodelKlini';

const InfoPageHerbranGyodelKlini = () => {
  return (
    <div className="info-page">
      <div className="left-panel"></div> 
      <div className='text'>
        <p className='title'>Հերբրան֊Գյոդել֊Կլինիի FP լեզու</p>
        <p>Նկարագրենք (M,C,X,T) քառյակը։</p>
        <p>M = N ∪ {'{⊥}'}, որտեղ N = {'{0,1,2,3, ... }'}</p>
        <p>{'X = {F^(k) | F^(k) ∈ V[M^k→M], k ≥ 1}'}</p>
        <p>Այսինքն՝ յուրաքանչյուր [M^k→M] տիպի համար ունենք մեկ փոփոխական։</p>
        <p>C = M ∪ C1 ∪ C2, որտեղ C1-ը առաջին կարգի հաստատուններ են, սիկ C2-ը՝ երկրորդ կարգի։ Նկարագրենք դրանք։</p>
        <p>{'C1 = {o, s} ∪ { I_i_k | k ≥ 1,1 ≤ i ≤ k}, որտեղ․'}</p>
        <p>o, s ∈ [M→M] և ցանկացած m ∈ M համար</p>
        <p>o(m) = 0, եթե m ∈ N, ⊥, եթե m=⊥</p>
        <p>s(m) = m+1, եթե m ∈ N, ⊥, եթե m=⊥</p>
        <p>I_i_k ∈ [M^k→M], k ≥ 1,1 ≤ i ≤ k, և ցանկացած m1,... ,mk ∈ M համար </p>
        <p>I_i_k(m1,...,mk) = mi, եթե m1,...,mk ∈ N, հակառակ դեպքում՝ ⊥</p>
        <p>{'C2 = { Sk | n, k ≥ 1} ∪ {Rk | k ≥ 1} ∪ {Mk | k ≥ 1}'}</p>
        <p>Նկարագրենք {'{Sk | n, k ≥ 1}'} բազմությունը, որտեղ S_k_n-ը (n, k ≥ 1) կանոնական եղադրման գործողություն է։</p>
        <p>S_k_n ∈ [[M^n→M]×[M^k→M]^n→[M^k→M]] և ցանկացած h ∈ [M^n→M], g1,...,gn ∈ [M^k→M] hamar S_k_n(h,g1,...,gn) = f ∈ [M^k→M], որը որոշվում է հետևյալ կերպ․ ցանկացած m1,... ,mk ∈ M համար</p>
        <p>f(m1,...,mk) = h(g1(m1,...,mk),...,gn(m1,...,mk)):</p>
        <p>Օրինակ 1։ Դիտարկենք C_0_2 ֆունկցիան, որը սահմանվում է հետևյալ կերպ․ ցանկացած m1, m2 ∈ M համար</p>
        <p>C_0_2(m1,m2) = 0, եթե m1, m2 ∈ N, հակառակ դեպքում՝ ⊥</p>
        <p>Հեշտ է համոզվել, որ C_0_2 ֆունկցիան ստացվում է o և I_1_2 ֆունկցիաներից կանոնական տեղադրման գործողության միջոցով․</p>
        <p>C_0_2(m1,m2) = o(I_1_2(m1,m2)),</p>
        <p>այսինքն՝</p>
        <p>Val(S_2_1(o, I_1_2)) = C_0_2</p>
        <p>և C_0_2 հանդիսանում է հետևյալ հավասարման լուծում․</p>
        <p>F^(2) = S_2_1(o, I_1_2)</p>
        <p>Օրինակ 2։ Դիտարկենք C_1_2 ֆունկցիան, որը սահմանվում է հետևյալ կերպ․ ցանկացած m1, m2 ∈ M համար</p>
        <p>C_1_2(m1,m2) = 1, եթե m1, m2 ∈ N, հակառակ դեպքում՝ ⊥</p>
        <p>Հեշտ է համոզվել, որ C_1_2 ֆունկցիան ստացվում է s, o և I_1_2 ֆունկցիաներից հետևյալ կերպ․ </p>
        <p>C_1_2(m1,m2) = s(o(I_1_2(m1,m2))) = s(C_0_2(m1,m2)),</p>
        <p>այսինքն՝</p>
        <p>Val(S2(s, S2(o, I_1_2 ))) = C_1_2</p>
        <p>և C_1_2 հանդիսանում է հետևյալ հավասարման լուծում․</p>
        <p>F^(2) = S_2_1(s, S_2_1(o, I_1_2))</p>
        <p>Նկարագրենք {'{Rk | k ≥ 1}'} բազմությունը, որտեղ Rk֊ն (k ≥ 1) պարզագույն անդրադարձման ործողություննէ։</p>
        <p>Նախ նկարագրենք R1֊ը․</p>
        <p>R1 ∈ [M×[M^2→M]→[M→M]] և ցանկացած m0 ∈ M, h ∈ [M^2→M] համար R1(m0,h) = f ∈ [M→M], որը որոշվում է հետևյալ կերպ․</p>
        <p>f(⊥) = ⊥</p>
        <p>f(0) = m0</p>
        <p>f(n+1) = h(n,f(n)), որտեղ </p>
        <p>Օրինակ 3։ իտարկենք sg ֆունկցիան, որը սահմանվում է հետևյալ կերպ․ ցանկացած m ∈ M համար</p>
        <p>sg(m) = ⊥, եթե m = ⊥, 0, եթե m = 0, 1, եթե m ≠ ⊥ և m ≠ 0</p>
        <p>Նկատենք, որ</p>
        <p>sg(⊥) = ⊥,</p>
        <p>sg(0) = 0 = m0,</p>
        <p>sg(n+1) = 1 = h(n, sg (n)), որտեղ n ∈ N և h = C_1_2 :</p>
        <p>Այսինքն՝ sg ֆունցկիան ստացվում է 0 հաստատունից և C_1_2 ֆունկցիայից պարզագույն անդրադարձման գործողության միջոցով․</p>
        <p>Val(R1(0, S_2_1(s, S_2_1(o, I_1_2)))) = sg</p>
        <p>և sg հանդիսանում է հետևյալ հավասարման լուծում</p>
        <p>F^(1) = R1(0, S_2_1(s, S_2_1(o, I_1_2)))</p>
        <p>{'Նկարագրենք Rk, k > 1:'}</p>
        <p>Rk ∈ [[M^(k-1)→M]×[M^(k+1)→M]→[M^k→M]] և ցանկացած g ∈ [M^(k-1)→M], h ∈ [M^(k+1)→M] ֆունկցիաների համար Rk(g,h) = f ∈ [M^k→M], որը որոշվում է հետևյալ կերպ․ ցանկացած m1,...,mk ∈ M համար</p>
        <p>f(m1, ..., mk-1, ⊥) = ⊥,</p>
        <p>f(m1, ..., mk-1, 0) = g(m1,...,mk-1),</p>
        <p>f(m1, ..., mk-1, n+1) = h(m1,...,mk-1,n,f(m1,...,mk-1,n)), որտեղ n ∈ N</p>
        <p>Օրինակ 4։ Դիտարկենք + ∈ [M^2→M] ֆունկցիան, որը սահմանվում է հետևյալ կերպ․ ցանկացած m1, m2 ∈ M համար m1+m2 հանդիսանում է m1, m2 թվերի գումարը, եթե m1, m2 ∈ N, և ⊥` մնացած դեպքերում։</p>
        <p>Նկատենք, որ ցանկացած m ∈ M համար</p>
        <p>m+⊥ = ⊥,</p>
        <p>m+0 = m = I_1_1(m)</p>
        <p>m+(n+1) = (m+n)+1 = h(m,n,m+n), որտեղ n ∈ N և h ∈ [M^3→M] ֆունկցիան սահմանվում է հետևյալ կերպ․ ցանկացած m1, m2, m3 ∈ M համար․</p>
        <p>h(m1,m1,m3) = m3+1, եթե m1, m2, m3 ∈ N, հակառակ դեպքում՝ ⊥։</p>
        <p>Նկատենք, որ h ֆունկցիան ստացվում է s և I_3_3 ֆունկցիաներից կանոնական տեղադրման գործողության միջոցով, այսինքն՝ </p>
        <p>Val(S_3_1(s, I_3_3)) = I_3_3</p>
        <p>Իսկ + ֆունկցիան ստացվում է I_1_1 և h ֆունկցիաներից պարզագույն անդրադարձման գործողության միջոցով, այսինքն՝</p>
        <p>Val(R2(I_1_1, S_3_1(s, I_3_1))) = +</p>
        <p>և + ֆունկցիան հանդիսանում է հետևյալ հավասարման լուծում․</p>
        <p>F^(2) = R2(I_1_1, S_3_1(s, I_3_1))</p>
        <p>Նկարագրենք {'{Mk | k ≥ 1}'} բազմությունը, որտեղ Mk (k ≥ 1) մինիմիզացիայի գորշողությունն է։</p>
        <p>Mk ∈ [[M^(k+1)→M]→[M^k→M]] և ցանկացած g ∈ [M^(k+1)→M] համար Mk(g) = f ∈ [M^k→M] և որոշվում է հետևյալ կերպ․ ցանկացած m1,...,mk ∈ M համար</p>
        <p>{'f(m1,...,mk) = n ∈ N, եթե g(m1,...,mk,n) = 0 և ∀z < n, g(m1,...,mk,z) ≠ 0 ¨ ≠ ⊥, մնացած դեպքերում՝ ⊥։'}</p>
        <p>Այսինքն՝</p>
        <p>f(m1,...,mk) = μy[g(m1,...,mk,y) = 0]</p>
        <p>Օրինակ 5։ Դիտարկենք sg’ ֆունկցիան, որը սահմանվում է հետևյալ կերպ․ ցանկացած m ∈ M համար</p>
        <p>sg’(m) = 0, եթե m = 0, մնացած դեպքերում՝ ⊥։</p>
        <p>Նկատենք, որ</p>
        <p>sg’(m) = μy[m + y = 0]</p>
        <p>Այսինքն՝ sg’ ֆունկցիան ստացվում է + ֆունկցիայից մինիմիզացիայի գորշողության իջոցով, այսինքն՝ </p>
        <p>Val(M1(R2(I_1_1, S_3_1(s, I_3_3)))) = sg’,</p>
        <p>և sg’ հանդիսանում է հետևյալ հավասարման լուծում․ </p>
        <p>F^(1) = M1(R2(I_1_1, S_3_1(s, I_3_3)))</p>
        <p>T ⊂ Λ(C) ⊂ Λ(C,X), որտեղ T֊ն այն թերմերի բազմությունն է, որոնք կառուցվում են՝ օգտագործելով միայն հաստատուններ C֊ից, ընդ որում, M բազմությանը պատկանող հաստատունները հանդիսանում են միայն R1 ֆունկցիոնալի առաջին րգումենտի արժեք։</p>
      </div>
      
    </div>
  );
};

export default InfoPageHerbranGyodelKlini;